#pragma once

void dialogReturn(int button, void *userdata) {}
#define dialog(text) cellMsgDialogOpen(1,text,dialogReturn,(void*) 0x0000aaab, NULL);


#pragma region Variables
Native_s** g_Natives;
int submenu = 0;
int submenuLevel;
int lastSubmenu[20];
int lastOption[20];
int optionCount;
//int currentOption;
bool optionPress = false;
bool rightPress = false;
bool leftPress = false;
bool fastRightPress = false;
bool fastLeftPress = false;
bool squarePress = false;
bool SpawnVehicle;

bool menuSounds = true;
bool keyboardActive = false;
int keyboardAction;
int *keyboardVar = 0;
char *infoText;
bool newTimerTick = true;
int maxTimerCount;
bool newTimerTick2 = true;
int maxTimerCount2;

bool instructions = true;
int instructCount;
int mov;
bool instructionsSetupThisFrame;
bool xInstruction;
bool squareInstruction;
bool lrInstruction;
int bannerTextRed = MenuColour_R; 
int bannerTextGreen = MenuColour_G;
int bannerTextBlue = MenuColour_B;
int bannerTextOpacity = 255;
int spritered = MenuColour_R;
int spritegreen = MenuColour_G;
int spriteblue = MenuColour_B;
int spriteopacity = 50;
bool undectedgmode = false;
bool Toggle = false;
int bannerTextFont = 1;
int bannerRectRed = MenuColour_R;
int bannerRectGreen = MenuColour_G;
int bannerRectBlue = MenuColour_B;
int bannerRectOpacity = 255;
int backgroundRed = 16;
int backgroundGreen = 16;
int backgroundBlue = 16;
int backgroundOpacity = 70;
int optionsRed = MenuColour_R;
int optionsGreen = MenuColour_G;
int optionsBlue = MenuColour_B;
int optionsOpacity = 255;
int optionsFont = 0;
float menuXCoord = 0.85f;
float menuYCoordMove = 0.70;
float textXCoord = 0.76f;
float menuYCoord = 0.45f;
float textYCoord = 0.20f;
int maxOptions = 18;
float checkboxshit = 0.875f;
float
UpDown = .1135f,
MenuWidth = .22f,
SpriteWidht = .3420f;
bool 
rockstarDeveloper,
badsportlobbyspoof = false;
#pragma endregion

#pragma region Random Defs
void Notify(char* Text, int Time = 4000)
{
	UI::_0xF42C43C7("STRING");
	UI::_ADD_TEXT_COMPONENT_STRING(Text);
	UI::_0x38F82261(Time, false);
}
void Notify(int Value, int Time = 4000)
{
	char buffer[100];
	sprintf(buffer, "%i", Value);
	Notify(buffer);
}
void Notify_Error(char* Text, int Time = 4000)
{
	char buffer[1024];
	sprintf(buffer, "%s%s", "~r~Error: ~w~", Text);
	Notify(buffer);
}
#pragma endregion

#pragma region structs_gopro_2027

/*
class scrThreadContext
{
public:
	std::uint32_t m_thread_id;           // 0x00
	joaat_t m_script_hash;               // 0x04
	eThreadState m_state;                // 0x08
	std::uint32_t m_instruction_pointer; // 0x0C
	std::uint32_t m_frame_pointer;       // 0x10
	std::uint32_t m_stack_pointer;       // 0x14
	float m_timer_a;                     // 0x18
	float m_timer_b;                     // 0x1C
	float m_timer_c;                     // 0x20 WAIT timer
	char _0x28[24];
	std::uint32_t m_stack_size;          // 0x40
	char _0x44[16];
};
class scrThread
{
public:
	scrThreadContext m_context;                           // 0x08
	void* m_stack;                                        // 0x54
	char _0x58[12];
	const char* m_exitMessage;                            // 0x64
	char m_name[32];                                                // 0x68
	char _0x88[8];
	std::uint32_t* m_unkPointer;                                // 0x90 
	char _0x94[20];
	scriptHandler* m_handler;                              // 0xA8 
	scriptHandlerNetComponent* m_netComponent;      // 0xAC 
	joaat_t m_scriptHash;                                    // 0xB0 
	char _0xB4[28];
	uint8_t m_flag1;                                 // 0xD0 
	uint8_t m_safeForNetworkGame;                    // 0xD1 
	uint8_t N0F18E0FF;                               // 0xD2 
	uint8_t N0F18BC4E;                               // 0xD3 
	uint8_t m_isMinigameScript;                      // 0xD4 
	uint8_t N0F192D5E;                               // 0xD5 
	uint8_t N0F193502;                               // 0xD6 
	uint8_t m_canBePaused;                           // 0xD7 
	uint8_t m_canRemoveBlipsFromOtherScripts;        // 0xD8 
	uint8_t N0F197F9C;                               // 0xD9 
	uint8_t N0F19A76A;                               // 0xDA 
	uint8_t N0F197F9D;                               // 0xDB 
	char _0x00DC[4];
	uint32_t* N0F17CF21;                             // 0xE0 
	char _0x00E4[4];
	uint32_t* N0F17CF23;                             // 0xE8 
	char _0x00EC[4];
};
*/
char *getClassName(unsigned int classAddress) {
	if (classAddress < 0x10000)
		return "ERROR";
	unsigned int classInfo = *(volatile unsigned int*)classAddress;
	if (classInfo < 0x10000)
		return "ERROR";
	classInfo = classInfo - 0x4;
	if (*(volatile unsigned int*)classInfo < 0x10000)
		return "ERROR";
	struct classNameInfo {
		unsigned int unk;
		char *name;
	};
	classNameInfo *className = (classNameInfo*)(*(volatile unsigned int*)classInfo);
	return className->name;
}
struct ClassData {//this would be the 0x19...
	unsigned int base;

	unsigned int getClassDataAddress() {
		return (unsigned int)&base;
	}
	char* className() {
		return getClassName(getClassDataAddress());
	}

	template <typename T>
	T(*call(unsigned int offset))(...) {//currently untested
		unsigned int __opd_s = *(volatile unsigned int*)(getClassDataAddress() + offset);
